test/request-response-samples/create__array_handling/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:impl="http://something.com/systems/2004/06/" xmlns:tns1="http://something.com/systems/2004/06/types" xmlns:intf="http://something.com/systems/2004/06/"><soap:Body><impl:create xmlns:impl="http://something.com/systems/2004/06/" xmlns="http://something.com/systems/2004/06/"><impl:workItem><tns1:fields><tns1:field><tns1:fieldName>GlobalBoolean</tns1:fieldName><tns1:fieldVal>TRUE</tns1:fieldVal></tns1:field></tns1:fields><tns1:itemType>DSPLT1</tns1:itemType><tns1:parties><tns1:party><tns1:partyType>ORIG</tns1:partyType><tns1:fields><tns1:field><tns1:fieldName>AccountType</tns1:fieldName><tns1:fieldVal>drth</tns1:fieldVal></tns1:field></tns1:fields></tns1:party></tns1:parties><tns1:status>DFRONT</tns1:status><tns1:statusType>InProcess</tns1:statusType></impl:workItem><impl:evaluateRule>false</impl:evaluateRule><impl:note><tns1:memo>test123</tns1:memo></impl:note></impl:create></soap:Body></soap:Envelope>